<?php
//带！项目为必填
/*-------------------------！机器人信息---------------------------*/

$_ENV["bottoken"] = "";//机器人密钥
$_ENV["botid"]="";//机器人ID@
$_ENV["botname"]="";//机器人名称@
$_ENV["boturl"] = "";//机器人所绑定的域名


/*-------------------------数据库---------------------------*/
$_ENV["servername"] = "localhost";//数据库地址
$_ENV["username"] = "";//用户名
$_ENV["formname"] = "";//表名
$_ENV["passwd"] = "";//密码
$_ENV["port"] = 3306;//端口

/*-------------------------宝塔信息---------------------------*/
$_ENV["btapi"] = "";//宝塔面板地址
$_ENV["btapikey"] = "";//宝塔密钥

/*-------------------------！Redis---------------------------*/
$_ENV["redis_host"] = "127.0.0.1";
$_ENV["redis_port"] = "6379";

/*-------------------------！其他---------------------------*/
$_ENV["checkwebhook"] = true;//官方服务器验证
$_ENV["debug"] = true;//是否创建日志开启调试模式
$_ENV['clean'] = true;//是否清理日志